
    <main>
        <script src="js/form.js" defer></script>
        <section class="main-section">
            <div class="main-section_container container">
                <div class="main_ad_block">
                    <div class="ad_block_text-content">
                        <div class="ad_block_title-content">
                            <h1>
                                Citron Карта
                            </h1>
                            <p>
                                Дебетовая карта “Citron” зарабатывайте деньги, а не бонусы. Закажите дебетовую карту и получайте кэшбэк в любимых категориях покупок
                            </p>
                        </div>
                        <div class="ad_block_bonus-content">
                            <div class="bonus_box">
                                <p class="bonus_box-title">
                                    Кэшбэк
                                </p>
                                <p class="bonus_box-value">
                                    5%
                                </p>
                            </div>
                            <span class="bonus_box-line"></span>
                            <div class="bonus_box">
                                <p class="bonus_box-title">
                                    Без
                                </p>
                                <p class="bonus_box-value">
                                    Комиссии
                                </p>
                            </div>
                            
                        </div>
                    </div>
                    <div class="ad_block_image-content">
                        <img src="img/cards/CardPreview/Original/CardPreview-7.png" alt="" class="ad_block_img">
                    </div>
                </div>
            </div>
        </section>
        <!-- <section class="services">
            <div class="services_container container">
                <h1>
                    Услуги
                </h1>
                <div class="services_content">
                    <a href="#" class="service_box">
                        <div class="service_text-content">
                            <p class="service_title">
                                Перевод на карту
                            </p>
                            <div class="service_description">
                                Переводите и конвертируйте валюты между счетами
                            </div>
                        </div>
                        <div class="service_image-content">
                            <img src="img/webp-convert/3D-Icon-2.webp" alt="" class="service_img">
                        </div>
                    </a>

                    <a href="#" class="service_box">
                        <div class="service_text-content">
                            <p class="service_title">
                                Перевод между счетами
                            </p>
                            <div class="service_description">
                                Переводите и конвертируйте валюты между счетами
                            </div>
                        </div>
                        <div class="service_image-content">
                            <img src="img/webp-convert/3D-Icon-1.webp" alt="" class="service_img">
                        </div>
                    </a>
                </div>
            </div>
        </section> -->

        <?php
            $card = $database->query("SELECT * FROM `bank_card-product` WHERE `id_category`='1' ORDER BY  `id_product` ASC")->fetch(PDO::FETCH_ASSOC);
            $cardImages = $database->query("SELECT * FROM `bank_card_image-path` WHERE `id_card`={$card['id_product']}")->fetchAll(PDO::FETCH_ASSOC);
        
            if(isset($_SESSION['USER'])) {
                $user = $database->query("SELECT * FROM `bank_users` WHERE `id_user`={$_SESSION['USER']}")->fetch(PDO::FETCH_ASSOC);
                if(isset($_GET['currencyID'])) {
                    $getCurrency = $_GET['currencyID'];
                    if(!empty($getCurrency)) {
                        $currencyID = $getCurrency;
                        $currencyInfo = $database->query("SELECT * FROM `bank_currency` WHERE `id_currency`='$currencyID'")->fetch(PDO::FETCH_ASSOC);

                    } else {
                        $currencyID = '';
                    }
                } else {
                    $currencyID = '';
                }
            }
        ?>
        <section id="orderCard" class="card_form home_form">
            <form action="actions/orderCard.php" method="POST" class="card_form_container container">
                <h1>Оформление карты</h1>

                <div class="card_form_content">
                    <div class="card_form_box">
                        <div class="card_form_text-content">
                            <div class="card_form_text-content_profile-data">
                                <div class="card_input_box">
                                    <p class="input_title">Имя</p>
                                    <input value="<?= $item = isset($_SESSION['USER']) ? $user['first_name'] : '' ?>" type="text" name="first_name" id="" class="input_style card_form_input" placeholder="Введите ваше имя"> 
                                </div>
                                <div class="card_input_box">
                                    <p class="input_title">Фамилия</p>
                                    <input value="<?= $item = isset($_SESSION['USER']) ? $user['middle_name'] : '' ?>" type="text" name="middle_name" id="" class="input_style card_form_input" placeholder="Введите ваше имя"> 
                                </div>
                                <div class="card_input_box">
                                    <p class="input_title">Отчество</p>
                                    <input value="<?= $item = isset($_SESSION['USER']) ? $user['last_name'] : '' ?>" type="text" name="last_name" id="" class="input_style card_form_input third_name" placeholder="Введите ваше имя"> 
                                    <div class="select_input_box">
                                        <div class="selector_box">
                                            <input type="checkbox" id="highload1" name="highload1">
                                            <label for="highload1" class="lb1"></label>
                                        </div>
                                        <div class="input_text">
                                            Нет отчества по паспорту
                                        </div>
                                        
                                    </div>
                                </div>
                                
                            </div>
                            <div class="card_form_text-content_card-data">
                                <div class="card_input_box">
                                    <p class="input_title">Имя и Фамилия на карте</p>
                                    <input type="text" name="name_card" id="" class="input_style card_form_input" placeholder="Введите ваше имя"> 
                                </div>
                                <?php
                                    if(!isset($_SESSION['USER'])) {
                                        echo '
                                        <div class="profile_input_box card_input_box ">
                                            <p class="input_title">Номер телефона</p>
                                            <input placeholder="+7 900 000-00-00" type="tel" name="number_phone" id="auth_input_phone_number" class="profile_input_style phone_input" autocomplete="off" value="" aria-labelledby="placeholder-fname">
                                            
                                        </div>
                        
                                        ';
                                    }
                                ?>
                                <div class="card_input_box">
                                    <p class="input_title">Платёжная система</p>
                                    
                                    <div class="card_input_block">
                                        
                                        <label for="type_card_visa" class="card_type_select">
                                            <input type="radio" checked="checked" name="cardPay" value="visa" />
                                            <span class="card_type_image_box image_box">
                                                <svg class="card_type_image_box image_box card_type-icon" width="45" height="15" viewBox="0 0 45 15" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                    <path d="M29.3186 0C30.7188 0 31.841 0.316623 32.5566 0.611042L32.0676 3.76013L31.7439 3.59263C31.0773 3.29821 30.221 3.01487 29.0399 3.03495C27.6259 3.03495 26.9723 3.68062 26.9723 4.28471C26.9641 4.96537 27.7361 5.41427 28.9985 6.08651C31.0822 7.12366 32.0452 8.3812 32.0317 10.0343C32.0036 13.0508 29.5391 15 25.7425 15C24.1228 14.9817 22.5623 14.6307 21.7188 14.2251L22.2258 10.9711L22.6915 11.2031C23.8777 11.7456 24.6457 11.9651 26.0913 11.9651C27.1294 11.9651 28.2436 11.5201 28.2524 10.546C28.2592 9.90995 27.7867 9.45645 26.3808 8.74417C25.0108 8.04897 23.1946 6.88442 23.2147 4.79634C23.2361 1.97165 25.7498 0 29.3186 0ZM0.0449334 0.461977H5.87558C6.66073 0.492367 7.29464 0.751154 7.51349 1.62334L8.77025 8.26382V8.26747L9.14778 10.2571L12.6879 0.461977H16.5174L10.8252 14.7994L6.99926 14.8031L3.95362 3.23372C5.76581 4.21651 7.30862 5.35361 8.20211 6.91841C7.97174 6.42327 7.6682 5.86435 7.27979 5.3135C6.82747 4.67201 5.85061 3.84376 5.4423 3.49139C4.0195 2.26359 2.08725 1.27197 0 0.747267L0.0449334 0.461977ZM18.0403 0.478527H21.7854L19.4426 14.7939H15.6976L18.0403 0.478527ZM39.1927 0.478527H42.0299L45 14.7939H41.5947C41.5947 14.7939 41.2569 13.1493 41.1471 12.6478C40.6118 12.6478 36.8685 12.6424 36.4473 12.6424C36.3048 13.0299 35.6742 14.7938 35.6742 14.7938H31.8213L37.2708 1.66751C37.6566 0.734722 38.3142 0.478527 39.1927 0.478527ZM39.4714 4.32883C39.2871 4.8613 38.9663 5.72118 38.9877 5.68342C38.9877 5.68342 37.8349 8.8308 37.5333 9.64786L40.5627 9.64598C40.2813 8.28094 39.9996 6.91596 39.7177 5.55103L39.4714 4.32883Z" fill=""/>
                                                </svg>
                                            </span>
                                        </label>

                                        <label for="type_card_visa" class="card_type_select">
                                            <input type="radio" name="cardPay" value="mastercard" />
                                            <span class="card_type_image_box image_box">
                                                <svg class="card_type-icon" width="37" height="29" viewBox="0 0 37 29" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                    <g clip-path="url(#clip0_164_2273)">
                                                        <path d="M6.72646 28.1909V26.3377C6.72646 25.6272 6.28218 25.164 5.52064 25.164C5.13994 25.164 4.72745 25.2875 4.44186 25.6891C4.21986 25.3493 3.90261 25.164 3.42667 25.164C3.10928 25.164 2.79218 25.2566 2.53824 25.5964V25.2257H1.87195V28.1909H2.53824V26.5539C2.53824 26.0289 2.82383 25.7817 3.26812 25.7817C3.71212 25.7817 3.93441 26.0597 3.93441 26.5539V28.1909H4.6007V26.5539C4.6007 26.0289 4.9178 25.7817 5.33029 25.7817C5.77458 25.7817 5.99658 26.0597 5.99658 26.5539V28.1909H6.72646ZM16.5938 25.2257H15.5151V24.33H14.8488V25.2257H14.246V25.8125H14.8487V27.1717C14.8487 27.8513 15.1343 28.2527 15.8958 28.2527C16.1814 28.2527 16.4985 28.1601 16.7208 28.0366L16.5303 27.4805C16.34 27.6041 16.118 27.635 15.9593 27.635C15.642 27.635 15.5151 27.4497 15.5151 27.1407V25.8125H16.5938V25.2257ZM22.2415 25.1638C21.8608 25.1638 21.607 25.3493 21.4483 25.5964V25.2257H20.782V28.1909H21.4483V26.523C21.4483 26.0289 21.6703 25.7509 22.0828 25.7509C22.2097 25.7509 22.3684 25.7818 22.4953 25.8126L22.6856 25.1949C22.5587 25.164 22.3684 25.164 22.2415 25.164V25.1638ZM13.7066 25.4728C13.3892 25.2566 12.9451 25.164 12.4691 25.164C11.7077 25.164 11.2001 25.5346 11.2001 26.1215C11.2001 26.6158 11.5808 26.8936 12.2471 26.9864L12.5644 27.0173C12.9134 27.079 13.1038 27.1717 13.1038 27.3262C13.1038 27.5423 12.85 27.6968 12.4057 27.6968C11.9615 27.6968 11.6125 27.5423 11.3903 27.3879L11.0731 27.8821C11.4221 28.1292 11.8981 28.2527 12.3739 28.2527C13.2623 28.2527 13.7701 27.8513 13.7701 27.2952C13.7701 26.7701 13.3576 26.4921 12.7229 26.3995L12.4057 26.3685C12.1201 26.3376 11.8981 26.276 11.8981 26.0907C11.8981 25.8744 12.1201 25.7509 12.4691 25.7509C12.85 25.7509 13.2307 25.9052 13.421 25.9979L13.7066 25.4728ZM31.411 25.164C31.0301 25.164 30.7763 25.3493 30.6176 25.5964V25.2257H29.9513V28.1909H30.6176V26.523C30.6176 26.0289 30.8398 25.7509 31.2521 25.7509C31.3792 25.7509 31.5379 25.7818 31.6648 25.8126L31.8551 25.1949C31.7282 25.164 31.5379 25.164 31.411 25.164ZM22.9078 26.7083C22.9078 27.6041 23.5422 28.2527 24.5259 28.2527C24.9701 28.2527 25.2873 28.1601 25.6046 27.913L25.2873 27.3879C25.0335 27.5732 24.7797 27.6658 24.4941 27.6658C23.9547 27.6658 23.574 27.2952 23.574 26.7083C23.574 26.1524 23.9547 25.7817 24.4941 25.7509C24.7797 25.7509 25.0335 25.8434 25.2873 26.0289L25.6046 25.5038C25.2873 25.2566 24.9701 25.164 24.5259 25.164C23.5422 25.164 22.9078 25.8126 22.9078 26.7083ZM29.0631 26.7083V25.2257H28.3968V25.5964C28.1746 25.3185 27.8574 25.164 27.4449 25.164C26.5882 25.164 25.922 25.8126 25.922 26.7083C25.922 27.6041 26.5882 28.2527 27.4449 28.2527C27.889 28.2527 28.2064 28.0984 28.3968 27.8203V28.1909H29.0631V26.7083ZM26.6199 26.7083C26.6199 26.1832 26.9689 25.7509 27.54 25.7509C28.0794 25.7509 28.4602 26.1524 28.4602 26.7083C28.4602 27.2334 28.0794 27.6658 27.54 27.6658C26.9689 27.6349 26.6199 27.2334 26.6199 26.7083ZM18.6562 25.164C17.7678 25.164 17.1331 25.7817 17.1331 26.7083C17.1331 27.635 17.7676 28.2527 18.6879 28.2527C19.132 28.2527 19.5763 28.1292 19.9253 27.8513L19.608 27.3879C19.3542 27.5732 19.0369 27.6968 18.7197 27.6968C18.3072 27.6968 17.8947 27.5115 17.7994 26.9862H20.0522V26.7393C20.084 25.7817 19.5129 25.164 18.6561 25.164H18.6562ZM18.6562 25.7199C19.0686 25.7199 19.3543 25.9671 19.4176 26.4305H17.8312C17.8947 26.0289 18.1803 25.7199 18.6562 25.7199ZM35.1866 26.7083V24.052H34.5203V25.5964C34.2981 25.3185 33.9809 25.164 33.5684 25.164C32.7117 25.164 32.0455 25.8126 32.0455 26.7083C32.0455 27.6041 32.7117 28.2527 33.5684 28.2527C34.0127 28.2527 34.3299 28.0984 34.5203 27.8203V28.1909H35.1866V26.7083ZM32.7435 26.7083C32.7435 26.1832 33.0924 25.7509 33.6636 25.7509C34.203 25.7509 34.5837 26.1524 34.5837 26.7083C34.5837 27.2334 34.203 27.6658 33.6636 27.6658C33.0924 27.6349 32.7435 27.2334 32.7435 26.7083ZM10.4703 26.7083V25.2257H9.80397V25.5964C9.58182 25.3185 9.26458 25.164 8.85209 25.164C7.99545 25.164 7.32916 25.8126 7.32916 26.7083C7.32916 27.6041 7.99545 28.2527 8.85209 28.2527C9.29638 28.2527 9.61362 28.0984 9.80397 27.8203V28.1909H10.4703V26.7083ZM7.99545 26.7083C7.99545 26.1832 8.34449 25.7509 8.91553 25.7509C9.45493 25.7509 9.83577 26.1524 9.83577 26.7083C9.83577 27.2334 9.45493 27.6658 8.91553 27.6658C8.34449 27.6349 7.99545 27.2334 7.99545 26.7083Z" fill="black"/>
                                                        <path d="M6.72646 28.1909V26.3377C6.72646 25.6272 6.28218 25.164 5.52064 25.164C5.13994 25.164 4.72745 25.2875 4.44186 25.6891C4.21986 25.3493 3.90261 25.164 3.42667 25.164C3.10928 25.164 2.79218 25.2566 2.53824 25.5964V25.2257H1.87195V28.1909H2.53824V26.5539C2.53824 26.0289 2.82383 25.7817 3.26812 25.7817C3.71212 25.7817 3.93441 26.0597 3.93441 26.5539V28.1909H4.6007V26.5539C4.6007 26.0289 4.9178 25.7817 5.33029 25.7817C5.77458 25.7817 5.99658 26.0597 5.99658 26.5539V28.1909H6.72646ZM16.5938 25.2257H15.5151V24.33H14.8488V25.2257H14.246V25.8125H14.8487V27.1717C14.8487 27.8513 15.1343 28.2527 15.8958 28.2527C16.1814 28.2527 16.4985 28.1601 16.7208 28.0366L16.5303 27.4805C16.34 27.6041 16.118 27.635 15.9593 27.635C15.642 27.635 15.5151 27.4497 15.5151 27.1407V25.8125H16.5938V25.2257ZM22.2415 25.1638C21.8608 25.1638 21.607 25.3493 21.4483 25.5964V25.2257H20.782V28.1909H21.4483V26.523C21.4483 26.0289 21.6703 25.7509 22.0828 25.7509C22.2097 25.7509 22.3684 25.7818 22.4953 25.8126L22.6856 25.1949C22.5587 25.164 22.3684 25.164 22.2415 25.164V25.1638ZM13.7066 25.4728C13.3892 25.2566 12.9451 25.164 12.4691 25.164C11.7077 25.164 11.2001 25.5346 11.2001 26.1215C11.2001 26.6158 11.5808 26.8936 12.2471 26.9864L12.5644 27.0173C12.9134 27.079 13.1038 27.1717 13.1038 27.3262C13.1038 27.5423 12.85 27.6968 12.4057 27.6968C11.9615 27.6968 11.6125 27.5423 11.3903 27.3879L11.0731 27.8821C11.4221 28.1292 11.8981 28.2527 12.3739 28.2527C13.2623 28.2527 13.7701 27.8513 13.7701 27.2952C13.7701 26.7701 13.3576 26.4921 12.7229 26.3995L12.4057 26.3685C12.1201 26.3376 11.8981 26.276 11.8981 26.0907C11.8981 25.8744 12.1201 25.7509 12.4691 25.7509C12.85 25.7509 13.2307 25.9052 13.421 25.9979L13.7066 25.4728ZM31.411 25.164C31.0301 25.164 30.7763 25.3493 30.6176 25.5964V25.2257H29.9513V28.1909H30.6176V26.523C30.6176 26.0289 30.8398 25.7509 31.2521 25.7509C31.3792 25.7509 31.5379 25.7818 31.6648 25.8126L31.8551 25.1949C31.7282 25.164 31.5379 25.164 31.411 25.164ZM22.9078 26.7083C22.9078 27.6041 23.5422 28.2527 24.5259 28.2527C24.9701 28.2527 25.2873 28.1601 25.6046 27.913L25.2873 27.3879C25.0335 27.5732 24.7797 27.6658 24.4941 27.6658C23.9547 27.6658 23.574 27.2952 23.574 26.7083C23.574 26.1524 23.9547 25.7817 24.4941 25.7509C24.7797 25.7509 25.0335 25.8434 25.2873 26.0289L25.6046 25.5038C25.2873 25.2566 24.9701 25.164 24.5259 25.164C23.5422 25.164 22.9078 25.8126 22.9078 26.7083ZM29.0631 26.7083V25.2257H28.3968V25.5964C28.1746 25.3185 27.8574 25.164 27.4449 25.164C26.5882 25.164 25.922 25.8126 25.922 26.7083C25.922 27.6041 26.5882 28.2527 27.4449 28.2527C27.889 28.2527 28.2064 28.0984 28.3968 27.8203V28.1909H29.0631V26.7083ZM26.6199 26.7083C26.6199 26.1832 26.9689 25.7509 27.54 25.7509C28.0794 25.7509 28.4602 26.1524 28.4602 26.7083C28.4602 27.2334 28.0794 27.6658 27.54 27.6658C26.9689 27.6349 26.6199 27.2334 26.6199 26.7083ZM18.6562 25.164C17.7678 25.164 17.1331 25.7817 17.1331 26.7083C17.1331 27.635 17.7676 28.2527 18.6879 28.2527C19.132 28.2527 19.5763 28.1292 19.9253 27.8513L19.608 27.3879C19.3542 27.5732 19.0369 27.6968 18.7197 27.6968C18.3072 27.6968 17.8947 27.5115 17.7994 26.9862H20.0522V26.7393C20.084 25.7817 19.5129 25.164 18.6561 25.164H18.6562ZM18.6562 25.7199C19.0686 25.7199 19.3543 25.9671 19.4176 26.4305H17.8312C17.8947 26.0289 18.1803 25.7199 18.6562 25.7199ZM35.1866 26.7083V24.052H34.5203V25.5964C34.2981 25.3185 33.9809 25.164 33.5684 25.164C32.7117 25.164 32.0455 25.8126 32.0455 26.7083C32.0455 27.6041 32.7117 28.2527 33.5684 28.2527C34.0127 28.2527 34.3299 28.0984 34.5203 27.8203V28.1909H35.1866V26.7083ZM32.7435 26.7083C32.7435 26.1832 33.0924 25.7509 33.6636 25.7509C34.203 25.7509 34.5837 26.1524 34.5837 26.7083C34.5837 27.2334 34.203 27.6658 33.6636 27.6658C33.0924 27.6349 32.7435 27.2334 32.7435 26.7083ZM10.4703 26.7083V25.2257H9.80397V25.5964C9.58182 25.3185 9.26458 25.164 8.85209 25.164C7.99545 25.164 7.32916 25.8126 7.32916 26.7083C7.32916 27.6041 7.99545 28.2527 8.85209 28.2527C9.29638 28.2527 9.61362 28.0984 9.80397 27.8203V28.1909H10.4703V26.7083ZM7.99545 26.7083C7.99545 26.1832 8.34449 25.7509 8.91553 25.7509C9.45493 25.7509 9.83577 26.1524 9.83577 26.7083C9.83577 27.2334 9.45493 27.6658 8.91553 27.6658C8.34449 27.6349 7.99545 27.2334 7.99545 26.7083Z" fill="#BAC3CC"/>
                                                        <path d="M13 3H23V20H13V3Z" fill="#9FADB1"/>
                                                        <path d="M14.1191 11.4497C14.1191 7.89768 15.8324 4.74704 18.4657 2.70839C16.5305 1.2258 14.0875 0.330078 11.4223 0.330078C5.10817 0.330078 0 5.30296 0 11.4497C0 17.5964 5.10817 22.5694 11.4222 22.5694C14.0873 22.5694 16.5303 21.6737 18.4657 20.1909C15.8324 18.1832 14.1191 15.0018 14.1191 11.4497Z" fill="#9FADB1"/>
                                                        <path d="M36.9633 11.4497C36.9633 17.5964 31.8551 22.5694 25.5411 22.5694C22.876 22.5694 20.433 21.6737 18.4976 20.1909C21.1627 18.1524 22.8443 15.0018 22.8443 11.4497C22.8443 7.89768 21.1309 4.74704 18.4976 2.70839C20.4328 1.2258 22.876 0.330078 25.5411 0.330078C31.8551 0.330078 36.9634 5.33392 36.9634 11.4497H36.9633Z" fill="#E7A079"/>
                                                        <path d="M36.9633 11.4497C36.9633 17.5964 31.8551 22.5694 25.5411 22.5694C22.876 22.5694 20.433 21.6737 18.4976 20.1909C21.1627 18.1524 22.8443 15.0018 22.8443 11.4497C22.8443 7.89768 21.1309 4.74704 18.4976 2.70839C20.4328 1.2258 22.876 0.330078 25.5411 0.330078C31.8551 0.330078 36.9634 5.33392 36.9634 11.4497H36.9633Z" fill="#BAC3CC"/>
                                                    </g>
                                                    <defs>
                                                        <clipPath id="clip0_164_2273">
                                                            <rect width="37" height="28" fill="white" transform="translate(0 0.330078)"/>
                                                        </clipPath>
                                                    </defs>
                                                </svg>
                                            </span>
                                        </label>

                                        <label for="type_card_visa" class="card_type_select">
                                            <input type="radio" name="cardPay" value="mir" />
                                            <span class="card_type_image_box image_box">
                                                <svg class="card_type-icon" width="46" height="13" viewBox="0 0 46 13" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                    <path fill-rule="evenodd" clip-rule="evenodd" d="M4.26136 0.0656612C4.67017 0.0631528 5.88515 -0.0490802 6.39979 1.73236C6.74645 2.93236 7.29867 4.89802 8.05644 7.62933H8.36505C9.1777 4.74979 9.73594 2.78413 10.0398 1.73236C10.5598 -0.0676369 11.8598 0.0656965 12.3798 0.0656965L16.3917 0.0657016V12.8657H12.3026V5.32244H12.0284L9.749 12.8657H6.6725L4.39305 5.31685H4.11885V12.8657H0.0297852V0.0657016L4.26136 0.0656612ZM22.2635 0.0657016V7.61455H22.5897L25.3625 1.40719C25.9007 0.171902 27.0479 0.0657016 27.0479 0.0657016H31.0049V12.8657H26.8304V5.31685H26.5042L23.7858 11.5242C23.2476 12.7539 22.0461 12.8657 22.0461 12.8657H18.0891V0.0657016H22.2635ZM45.4337 6.14834C44.8514 7.84074 43.0227 9.05278 40.9982 9.05278H36.6204V12.8657H32.6508V6.14834H45.4337Z" fill="#1EAF37"/>
                                                    <path fill-rule="evenodd" clip-rule="evenodd" d="M4.26136 0.0656612C4.67017 0.0631528 5.88515 -0.0490802 6.39979 1.73236C6.74645 2.93236 7.29867 4.89802 8.05644 7.62933H8.36505C9.1777 4.74979 9.73594 2.78413 10.0398 1.73236C10.5598 -0.0676369 11.8598 0.0656965 12.3798 0.0656965L16.3917 0.0657016V12.8657H12.3026V5.32244H12.0284L9.749 12.8657H6.6725L4.39305 5.31685H4.11885V12.8657H0.0297852V0.0657016L4.26136 0.0656612ZM22.2635 0.0657016V7.61455H22.5897L25.3625 1.40719C25.9007 0.171902 27.0479 0.0657016 27.0479 0.0657016H31.0049V12.8657H26.8304V5.31685H26.5042L23.7858 11.5242C23.2476 12.7539 22.0461 12.8657 22.0461 12.8657H18.0891V0.0657016H22.2635ZM45.4337 6.14834C44.8514 7.84074 43.0227 9.05278 40.9982 9.05278H36.6204V12.8657H32.6508V6.14834H45.4337Z" fill="#BAC3CC"/>
                                                    <path fill-rule="evenodd" clip-rule="evenodd" d="M41.1897 0.0656738H32.4426C32.6508 2.91539 35.0435 5.35493 37.5205 5.35493H45.7095C46.1821 2.98648 44.5553 0.0656738 41.1897 0.0656738Z" fill="#BAC3CC"/>
                                                </svg>
                                            </span>
                                        </label>
                                    </div>
                                </div>
                                <div class="card_input_box">
                                    <p class="input_title">Валюта</p>
                                    <div class="select">
                                        <div class="select__header">
                                            <span class="select__current"><?php
                                                if(isset($_GET['currencyID'])) {
                                                    echo $currencyInfo['name'];
                                                } else {
                                                    echo 'Валюта';
                                                }
                                            ?></span>
                                            <input value="<?=$currencyID?>" name="currency" class="select__current-input"/>
                                            <div class="select__icon arrow_image-box">
                                                <svg class="arrow_img" width="9" height="6" viewBox="0 0 9 6" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                    <path fill-rule="evenodd" clip-rule="evenodd" d="M8.83824 1.62443L5.32362 5.1609C5.10794 5.37791 4.75827 5.37791 4.54259 5.1609L1.02797 1.62443C0.812292 1.40741 0.812292 1.05556 1.02797 0.838543C1.24364 0.621527 1.59332 0.621527 1.809 0.838543L4.60959 3.65655L5.25662 3.65655L8.05722 0.838543C8.27289 0.621527 8.62257 0.621527 8.83824 0.838543C9.05392 1.05556 9.05392 1.40741 8.83824 1.62443Z" fill="black"/>
                                                </svg>
                                                    
                                            </div>
                                        </div>
                                    
                                        <div class="select__body">
                                            <?php
                                                $currencies = $database->query("SELECT * FROM `bank_currency`")->fetchAll(PDO::FETCH_ASSOC);

                                                foreach($currencies as $item) {
                                                    echo '<div value="'.$item['id_currency'].'" class="select__item">'.$item['name'].'</div>';
                                                }
                                            ?>
                                        </div>
                                    </div>
                                </div>
                            </div>
                        </div>
                        <div class="card_form_image-content">
                            <div class="card_main-image_box">
                                <img src="img/cards/CardIcon/Original/CitronCard_Front-6.png" alt="" class="card_main-img">
                            </div>
                            <!-- <div class="card_design_variants">
                                <div class="swiper card_design_swiper">

                                    <div class="swiper-wrapper">

                                    <?php
                                        foreach($cardImages as $item) {
                                            echo '
                                                <div class="swiper-slide">
                                                    <img src="'.$item['image-path'].'" alt="" class="card_design_img">
                                                </div>
                                            ';
                                        }
                                    ?>
                                    </div>

                                </div>
                            </div> -->
                            <?php
                                if(!isset($_SESSION['USER'])) {
                                    echo '
                                        <a href="?page=registration" class="card_form_button button_style">
                                            Перейти к регистрации
                                        </a>
                                    ';

                                } else {
                                    echo '
                                    <button type="submit" href="#" class="card_form_button button_style">
                                        Отправить заявку
                                    </button>
                                    ';
                                }
                            
                            ?>
                        </div>
                    </div>
                    
                </div>
            </form>
        </section>

        
        <div class="feedback">
            <div class="feedback_container container">
                <h1>Оставьте свою почту для подписки на рассылку</h1>
                <form method="POST" class="feedback_form">
                    <div class="error error-log error_message_block error_message">
                        <p></p>
                    </div>
                    <div class="feedback_input_block">
                        <input type="text" name="email" id="feedback_input_email" class="feedback_input input_style card_form_input" placeholder="Введите ваш email">
                        <button type="submit" class="button-form button_style" name="send_email">Отправить</button>
                    </div>
                </form>
            </div>
        </div>
    </main>

    
  


    